app/controllers/api_controller.rb

SELECT "availability_rules".* FROM "availability_rules" WHERE "availability_rules"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 11]]
SELECT "tours".* FROM "tours"
---
  def get_availability_tours
    tours = Tour.includes(availabilities: :availability_rule)
                .all
                .as_json(include: { availabilities: { include: :availability_rule } })

SELECT "availabilities".* FROM "availabilities" WHERE "availabilities"."tour_id" IN (?, ?, ?)  [["tour_id", 1], ["tour_id", 2], ["tour_id", 3]]
INSERT INTO "availabilities" ("tour_id", "availability_rule_id", "start_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["tour_id", 4], ["availability_rule_id", 12], ["start_time", "2024-04-01 10:00:00"], ["created_at", "2024-03-28 04:53:43.915271"], ["updated_at", "2024-03-28 04:53:43.915271"]]
INSERT INTO "availability_rules" ("rule_type", "rule_data", "created_at", "updated_at") VALUES (?, ?, ?, ?)
INSERT INTO "tours" ("name", "description", "duration_hours", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "availabilities" ("tour_id", "availability_rule_id", "start_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["tour_id", 5], ["availability_rule_id", 13], ["start_time", "2024-04-01 10:00:00"], ["created_at", "2024-03-28 08:24:56.630844"], ["updated_at", "2024-03-28 08:24:56.630844"]]
---
  def create_tour_availability
    # Extract input data from params
    tour_params = params.require(:tour).permit(:name, :description, :duration_hours, :duration_days)
    availability_params = params.require(:availability).permit(:start_time)
    availability_rule_params = params.require(:availability_rule).permit(:rule_type, rule_data: {})

    if tour_params.blank? ||
       availability_params.blank? ||
       availability_rule_params.blank? ||
       tour_params[:name].blank? ||
       availability_params[:start_time].blank? ||
       availability_rule_params[:rule_type].blank?
       render json: { error: "Failed to create tour" }, status: :unprocessable_entity
       return
    end

    # Permit additional nested parameters based on rule_type
    case availability_rule_params[:rule_type]
    when "specific_dates"
      availability_rule_params[:rule_data].permit(dates: [])
    when "weekly"
      params.require(:availability_rule).permit(:rule_type, rule_data: { days: [] })
    when "monthly"
      params.require(:availability_rule).permit(:rule_type, rule_data: { days_of_month: [], week_numbers: [] })
    # Add more cases for other rule types as needed
    else
      params.require(:availability_rule).permit(:rule_type, rule_data: [:custom_criteria])
    end

    # Create availability_rule record
    availability_rule = AvailabilityRule.create(availability_rule_params)

    if availability_rule.persisted?
      # Create tour record
      tour = Tour.create(tour_params)

      if tour.persisted?
        # Create availability record associated with the tour and availability_rule
        availability = tour.availabilities.create(availability_params.merge(availability_rule_id: availability_rule.id))