app/controllers/api_controller.rb

INSERT INTO "availabilities" ("tour_id", "availability_rule_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tour_id", 1], ["availability_rule_id", 1], ["created_at", "2024-03-28 04:05:51.282671"], ["updated_at", "2024-03-28 04:05:51.282671"]]
INSERT INTO "availability_rules" ("rule_type", "created_at", "updated_at") VALUES (?, ?, ?)  [["rule_type", ""], ["created_at", "2024-03-28 04:05:51.240854"], ["updated_at", "2024-03-28 04:05:51.240854"]]
INSERT INTO "tours" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2024-03-28 04:05:51.255464"], ["updated_at", "2024-03-28 04:05:51.255464"]]
---
  def create_tour_availability
    # Extract input data from params
    tour_params = params.require(:tour).permit(:name, :description, :duration_hours, :duration_days)
    availability_params = params.require(:availability).permit(:start_time)
    availability_rule_params = params.require(:availability_rule).permit(:rule_type, rule_data: {})

    if tour_params.blank? ||
       availability_params.blank? ||
       availability_rule_params.blank? ||
       tour_params[:name].blank? ||
       availability_params[:start_time].blank? ||
       availability_rule_params[:rule_type].blank?
       render json: { error: "Failed to create tour" }, status: :unprocessable_entity
       return
    end

    # Permit additional nested parameters based on rule_type
    case availability_rule_params[:rule_type]
    when "specific_dates"
      availability_rule_params[:rule_data].permit(dates: [])
    when "weekly"
      params.require(:availability_rule).permit(:rule_type, rule_data: { days: [] })
    when "monthly"
      params.require(:availability_rule).permit(:rule_type, rule_data: { days_of_month: [], week_numbers: [] })
    # Add more cases for other rule types as needed
    else
      params.require(:availability_rule).permit(:rule_type, rule_data: [:custom_criteria])
    end

    # Create availability_rule record
    availability_rule = AvailabilityRule.create(availability_rule_params)

    if availability_rule.persisted?
      # Create tour record
      tour = Tour.create(tour_params)