app/controllers/availabilities_controller.rb

SELECT "availabilities".* FROM "availabilities"
---
    def index
      @availabilities = Availability.all

INSERT INTO "availabilities" ("tour_id", "availability_rule_id", "start_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["tour_id", 1], ["availability_rule_id", 1], ["start_time", "2024-04-01 09:00:00"], ["created_at", "2024-03-28 02:52:03.138040"], ["updated_at", "2024-03-28 02:52:03.138040"]]
---
    def create
      @availability = Availability.new(availability_params)
      if @availability.save