app/controllers/availability_rules_controller.rb

    def index
      @availability_rules = AvailabilityRule.all
---
SELECT "availability_rules".* FROM "availability_rules"

    def create
      @availability_rule = AvailabilityRule.new(availability_rule_params)
      if @availability_rule.save
---
INSERT INTO "availability_rules" ("rule_type", "rule_data", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["rule_type", "specific_dates"], ["rule_data", "{}"], ["created_at", "2024-03-27 15:42:53.570444"], ["updated_at", "2024-03-27 15:42:53.570444"]]