app/controllers/availability_rules_controller.rb

    def update
      if @availability_rule.update(availability_rule_params)
---
UPDATE "availability_rules" SET "rule_type" = ?, "rule_data" = ?, "updated_at" = ? WHERE "availability_rules"."id" = ?  [["rule_type", "weekly"], ["rule_data", "{\"days\":[\"Monday\",\"Wednesday\",\"Friday\"]}"], ["updated_at", "2024-03-28 04:42:34.088505"], ["id", 1]]

    def destroy
      @availability_rule.destroy
---
DELETE FROM "availability_rules" WHERE "availability_rules"."id" = ?  [["id", 1]]

    def set_availability_rule
      @availability_rule = AvailabilityRule.find(params[:id])
---
SELECT "availability_rules".* FROM "availability_rules" WHERE "availability_rules"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]