app/controllers/availabilities_controller.rb

UPDATE "availabilities" SET "start_time" = ?, "updated_at" = ? WHERE "availabilities"."id" = ?  [["start_time", "2024-03-28 04:45:34"], ["updated_at", "2024-03-28 04:45:34.691606"], ["id", 1]]
---
    def update
      if @availability.update(availability_params)

DELETE FROM "availabilities" WHERE "availabilities"."id" = ?  [["id", 1]]
---
    def destroy
      @availability.destroy

SELECT "availabilities".* FROM "availabilities" WHERE "availabilities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_availability
      @availability = Availability.find(params[:id])