app/controllers/tours_controller.rb

  def create
    @tour = Tour.new(tour_params)
    if @tour.save
---
INSERT INTO "tours" ("name", "description", "duration_hours", "duration_days", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @tour.update(tour_params)
---
UPDATE "tours" SET "name" = ?, "updated_at" = ? WHERE "tours"."id" = ?  [["name", "New Tour Name"], ["updated_at", "2024-03-28 04:09:12.214889"], ["id", 1]]

  def destroy
    @tour.destroy
---
DELETE FROM "tours" WHERE "tours"."id" = ?  [["id", 1]]

  def set_tour
    @tour = Tour.find(params[:id])
---
SELECT "tours".* FROM "tours" WHERE "tours"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]