app/controllers/tours_controller.rb

  def index
    @tours = Tour.all
---
SELECT "tours".* FROM "tours"

  def create
    @tour = Tour.new(tour_params)
    if @tour.save
---
INSERT INTO "tours" ("name", "duration_hours", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Guided City Tour"], ["duration_hours", 3], ["created_at", "2024-03-27 15:22:38.347747"], ["updated_at", "2024-03-27 15:22:38.347747"]]